Rails/cook3/app/views/users/show.html.erb

  <section class="current-user">
  <% @user.gohans.each do |t| %>
---
SELECT `gohans`.* FROM `gohans` WHERE `gohans`.`user_id` = 1

  <section class="current-user">
  <% @user.liked_gohans.each do |t| %>
---
SELECT `gohans`.* FROM `gohans` WHERE `gohans`.`user_id` = 1