Rails/cook3/app/models/user.rb

SELECT 1 AS one FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`gohan_id` = 6 LIMIT 1
---
  def already_liked?(gohan)
    self.likes.exists?(gohan_id: gohan.id)