Rails/cook3/app/views/gohans/show.html.erb

      </div>
        <p class="username">  <%= t.user.name unless t.user.blank? %></p>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1