Rails/cook3/app/controllers/comments_controller.rb

SELECT `gohans`.* FROM `gohans` WHERE `gohans`.`id` = 3 LIMIT 1
INSERT INTO `comments` (`comment`, `user_id`, `gohan_id`, `created_at`, `updated_at`) VALUES ('うまそう', 1, 3, '2020-07-08 15:06:47.739011', '2020-07-08 15:06:47.739011')
---
  def create
    gohan = Gohan.find(params[:gohan_id])
    @comment = gohan.comments.build(comment_params)
    @comment.user_id = current_user.id
    if @comment.save