Rails/cook3/app/controllers/gohans_controller.rb

  def index
    if params[:search] != nil && params[:search] != ''
      #部分検索かつ複数検索
      @gohans = Gohan.where("title LIKE ? ", "%" + params[:search] + "%").or(Gohan.where("food LIKE ? ", "%" + params[:search] + "%"))
    else
      @gohans = Gohan.all
---
SELECT `gohans`.* FROM `gohans` WHERE ((title LIKE '%にく%' ) OR (gohan LIKE '%にく%' ))
SELECT `gohans`.* FROM `gohans`

  def show
    @gohan = Gohan.find(params[:id])
---
SELECT `gohans`.* FROM `gohans` WHERE `gohans`.`id` = 2 LIMIT 1

  def edit
    @gohan = Gohan.find(params[:id])
---
SELECT `gohans`.* FROM `gohans` WHERE `gohans`.`id` = 9 LIMIT 1

  def create
    @gohan = Gohan.new(gohan_params)
    @gohan.user_id = current_user.id
    if @gohan.save
---
INSERT INTO `gohans` (`created_at`, `updated_at`, `title`, `image`, `food`, `recipe`, `user_id`) VALUES ('2020-07-10 06:08:24.337841', '2020-07-10 06:08:24.337841', 'a', 'aa', 'aaaaa', 'aaaaa', 1)

  def update
    @gohan = Gohan.find(params[:id])
    if @gohan.update(gohan_params)
---
SELECT `gohans`.* FROM `gohans` WHERE `gohans`.`id` = 1 LIMIT 1
UPDATE `gohans` SET `gohans`.`image` = 'IMG_3886_1_.JPG', `gohans`.`updated_at` = '2020-07-14 20:21:45.099661' WHERE `gohans`.`id` = 17

  def destroy
    Gohan.find(params[:id]).destroy
---
DELETE FROM `gohans` WHERE `gohans`.`id` = 4
SELECT `gohans`.* FROM `gohans` WHERE `gohans`.`id` = 4 LIMIT 1