Rails/cook3/app/controllers/likes_controller.rb

INSERT INTO `likes` (`gohan_id`, `user_id`, `created_at`, `updated_at`) VALUES (2, 1, '2020-07-08 14:57:44.584963', '2020-07-08 14:57:44.584963')
---
    def create
        @like = current_user.likes.create(gohan_id: params[:gohan_id])

SELECT `likes`.* FROM `likes` WHERE `likes`.`gohan_id` = 15 AND `likes`.`user_id` = 1 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 9
---
      def destroy
        @like = Like.find_by(gohan_id: params[:gohan_id], user_id: current_user.id)
        @like.destroy